Documents/ПрейскурантЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПрейскурантЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Прейскурант</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеВключатьВПрайс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Прейскурант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Прейскурант</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НеВключатьВПрайс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиВПрейскуранте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрейскурантЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыЦены

&НаСервере
Функция ЗаполнитьНаСервере(ВыбраннаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПрейскурантСрезПоследних.Цена КАК Цена,
		|	ПрейскурантСрезПоследних.Период КАК Период,
		|	ПрейскурантСрезПоследних.НДС КАК НДС,
		|	ПрейскурантСрезПоследних.НеВключатьВПрайс КАК НеВключатьВПрайс,
		|	ПрейскурантСрезПоследних.НомерСтрокиВПрейскуранте КАК НомерСтрокиВПрейскуранте
		|ИЗ
		|	РегистрСведений.Прейскурант.СрезПоследних(&ВыбраннаяДата, ) КАК ПрейскурантСрезПоследних
		|ГДЕ
		|	ПрейскурантСрезПоследних.Цена > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиВПрейскуранте";
	
	Запрос.УстановитьПараметр("ВыбраннаяДата", ВыбраннаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = РезультатЗапроса.Выгрузить();
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТЗ Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ЦеныНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	Если Не ПустаяСтрока(СтрокаДанных.НДС) Тогда
		СтрокаДанных.СтараяЦена = ВозвратСтаройЦены(ВыбранноеЗначение, СтрокаДанных.НДС, Объект.Дата);
		СтрокаДанных.СтараяЦенаСНДС = СтрокаДанных.СтараяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
		СтрокаДанных.НоваяЦена = СтрокаДанных.СтараяЦена;
		СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	Если Не ПустаяСтрока(СтрокаДанных.Номенклатура) Тогда
		СтрокаДанных.СтараяЦена = ВозвратСтаройЦены(СтрокаДанных.Номенклатура, ВыбранноеЗначение, Объект.Дата);
		СтрокаДанных.СтараяЦенаСНДС = СтрокаДанных.СтараяЦена * (1+(ВозвратНДС(ВыбранноеЗначение)/100));
		СтрокаДанных.НоваяЦена = СтрокаДанных.НоваяЦена;
		СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(ВыбранноеЗначение)/100));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныНоваяЦенаПриИзменении(Элемент)
	СтрокаДанных = Элементы.Цены.ТекущиеДанные;
	СтрокаДанных.НоваяЦенаСНДС = СтрокаДанных.НоваяЦена * (1+(ВозвратНДС(СтрокаДанных.НДС)/100));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Цены.Очистить();
	МассивЦен = ЗаполнитьНаСервере(Объект.Дата);
	Для Каждого СтрокаЗаполнения Из МассивЦен Цикл
			СтрокаДобавления = Объект.Цены.Добавить();
			СтрокаДобавления.Номенклатура = СтрокаЗаполнения.Номенклатура;
			СтрокаДобавления.НДС = СтрокаЗаполнения.НДС;
			СтрокаДобавления.СтараяЦена = СтрокаЗаполнения.Цена;
			СтрокаДобавления.СтараяЦенаСНДС = СтрокаЗаполнения.Цена * (1+(ВозвратНДС(СтрокаЗаполнения.НДС)/100));
			СтрокаДобавления.НоваяЦена = СтрокаЗаполнения.Цена;
			СтрокаДобавления.НоваяЦенаСНДС  = СтрокаЗаполнения.Цена * (1+(ВозвратНДС(СтрокаЗаполнения.НДС)/100));
			СтрокаДобавления.НеВключатьВПрайс = СтрокаЗаполнения.НеВключатьВПрайс;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВозвратНДС(СтавкаНДС)
	 НДС = СтавкаНДС.Значение;
	 Возврат НДС;
КонецФункции

&НаСервереБезКонтекста
Функция ВозвратСтаройЦены(Номенклатура, НДС, ДатаПрейскуранта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантСрезПоследних.Период КАК Период,
		|	ПрейскурантСрезПоследних.Регистратор КАК Регистратор,
		|	ПрейскурантСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	ПрейскурантСрезПоследних.Активность КАК Активность,
		|	ПрейскурантСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПрейскурантСрезПоследних.НДС КАК НДС,
		|	ПрейскурантСрезПоследних.Цена КАК Цена,
		|	ПрейскурантСрезПоследних.НеВключатьВПрайс КАК НеВключатьВПрайс
		|ИЗ
		|	РегистрСведений.Прейскурант.СрезПоследних(&ДатаПрейскуранта, ) КАК ПрейскурантСрезПоследних
		|ГДЕ
		|	ПрейскурантСрезПоследних.Номенклатура = &Номенклатура
		|	И ПрейскурантСрезПоследних.НДС = &НДС";
	
	Запрос.УстановитьПараметр("ДатаПрейскуранта", ДатаПрейскуранта);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НДС", НДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат 0;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();	
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Цены.Имя); 
    ПолеОформления.Использование = Истина;
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Цены.СтараяЦена");
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;    
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Цены.НоваяЦена");
    ЭлементОтбора.Использование  = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ЦианТемный);
КонецПроцедуры

#КонецОбласти
